OpenDTEF-v1812/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0/filmRegion/deltaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/filmRegion";
    object      deltaf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 1e-6;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    region0_to_filmRegion_coupledWall
    {
        type            zeroGradient;
    }

    "side.*"
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform  6e-4;
    }

    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
